Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>PLcrbEkhczVQ527X4GOwuE4fXRjz1SyhgII68Ee6hAq+XRXAjdmuWs4fBKj2OB0acvWc1k0+NKa2&#13;
Q0m3A+7VFFhZ1dmSU0XQpVDNKWRguxBnBrN+K8fjqGQDg5MfxGXY80fXzPcvr/xMViyOTl+lsoVL&#13;
Lj2RJ8wCpTTZT/Id8JG22q7iZfL+jITqb4IX4Q3TAVWswfme1vxVcz+UTgeAT8m1ySYU9gDwE6I1&#13;
i5+ekT7Re7kxqzvzQOyWHGqB/T7PIlIgTargBmmC8drRZ5eR2VMAGoIhJPuE8SJSW2zPEWZUtqBO&#13;
i0sSnsEu4mZbP6ALNUMZG8YO768YptZNRc68DQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>biactWn7ToXVDP6FqIP4Sevpy1I4/NISAVC3ZNNqffJGD0XzTnDIx7xTaqevU46JXffV5wJ8aSEQ&#13;
Gdk2Pyi7mSteqwGoN2ZvazljubasVnoA6PiYvnloBTtJvZ9AlnICKq4sH8jPqL7rn4zw/Mj+BIop&#13;
XsioStm9aQXdtLhPNfg5JcPSOpN25QaOJwyw+tWeqgj4RmRT2m4lkd1MlOjroqMIwwITV51EDKGh&#13;
x9AgnNP+oEcjLVqsHJn80tvPmELf5VOt7xvvktjFYeMTr1TCshH516Dkzg921eypR3/3lapwev8D&#13;
Dod/DJeEQA2ZXS0+c+Wvk7MLxkbZhSEmmvi9Vu2lOWVR8uXOKi8JeoLm240oNpvt/wTuCSildZsz&#13;
vbBqwoW/6lz28N2AKWPs+VOluqN1ih22k+VAuvGWJbuyE8wCzJHrm3o28BTLG4SHtCuz7CFiRtGe&#13;
HFZfDvcKWX2u56WBt3L/0barkdBS4C99eAY9GuolJu0tYNnhRxnJHYc8n4Ir9y2hToeHDaSzjMZl&#13;
ED/0Tueaa7yLZtRb/51MPU0cWNKNYZfLK+VwDpA8kB/I7APELUoK75XmJDQoSKWfhbLTsSq9lBVP&#13;
hXFS6FoDV+zEKxeOuOv3R3eYrwMLssUGhojb4TVOQuzNEvnnkIh/CrsjDDvtSTvvnN4wkjRn4+6T&#13;
u04pq6eNUyL1ZllNICanvzsZpRSMf6qU5wAnoOFlmgKr71B3RS2uDV39lX/+28xv8JonEpgQG1q3&#13;
DpPE08sQNQNeTMnbIAQXWkoWLjgkOgWZBhJDO0tn7uwkotXzi1foith2E/JMvx0SX63cQtr8dKhm&#13;
/BucYxgIWzmfnvlj2Yu7dTc8/4SgDhASF1pQyNZZmqMeZoXg/fEc86WkW+VjMrqsgjQ6nGdff2ap&#13;
wiGXLIf2Ic8J79QkuEdzSZSMyegbbc70SqdFhQ==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>qsjm09x8tPCGYbjLPwcQZWJS7UE=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
qUhBOmc4vjSJ4S3lXxI7JQ6+B6p/xmkGht9OXjEOnAp+4676M9nees0U0w8t2aIF+gEz0Z16dCmN&#13;
KhC64Z5LhIaOFz1FFaVpHbtabd09UlIsSPsq29HuSkyGOSew8pV9iEFzE3RWpL1dhDbals4JzYjW&#13;
rCLrYRpp4gZuPH+WEFds+kmp8DSN5gyCHvqiJcy/xfe1cB2aocawFux8Pg3moUrAZaGW+1PzfCYo&#13;
g6wZrVP5DQqSdq7bWi4NvJHdAKyk01qPAUvZ98Er+O6CBT9SHFuHHVYTU0+s7lbGUPAjOzfFiPvw&#13;
PuRZHkV17dfSgQyHpiv1Y3ZPPlxKjeWucQXJWQ==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>